Revit 2024 API
ConnectionInputPoint Class
 An object that holds information about a connection input point
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class ConnectionInputPoint : IDisposable
Visual Basic
Public Class ConnectionInputPoint _
	Implements IDisposable
Visual C++
public ref class ConnectionInputPoint : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ConnectionInputPoint
See Also
ConnectionInputPoint Members
Autodesk.Revit.DB.Structure Namespace